[
	{"Text":"And so the party ventured forth into the dungeon, in search of gold and glory."},
	{
		"Label":"DOOR",
		"Text":"Standing before them was a moldy old wooden door. They...",
		"Choices":[
			{"Text":"Opened it.", "Next":"BASIC COMBAT"},
			{"Text":"Kicked it down. [Athletics check]", "Next":"ATHLETICS"},
			{"Text":"Opened it cautiously and snuck inside. [Stealth check]", "Next":"STEALTH"},
			{"Text":"Decided to wait and listen. [Perception check, -1 resource point]", "Next":"PERCEPTION"}
		]
	},
	
	
	{
		"Label":"DOOR AUTO STEALTH",
		"Text":"Standing before them was a moldy old wooden door. Behind which, goblins were gambling. It would be trivial to sneak past them. They...",
		"Choices":[
			{"Text":"Opened the door.", "Next":"BASIC COMBAT"},
			{"Text":"Kicked down the door. [Athletics check]", "Next":"ATHLETICS"},
			{"Text":"Opened the door cautiously and snuck inside.", "Next":"STEALTH SUCC"},
		]
	},
	
	
	
	{
		"Label":"BASIC COMBAT",
		"Text":"Opening the door, the party saw goblins on the other side. Fangs and claws as sharp as the blades they carried. A combat began.",
	},	{"Combat":"PCs"},
	
	
	
	{
		"Label":"ATHLETICS",
		"Text":"The party's warrior, Magnus, had been sitting on a rock while the mage and thief decided their next course of action. Impatiently, he charged between the both of them and kicked down the door."
	}, {
		"Check":{
			"Skill":"Athletics",
			"Character":"Warrior",
			"Success":"ATH SUCC",
			"Mixed":"ATH MIX",
			"Failure":"ATH FAIL"
		}
	},
	{
		"Label":"ATH SUCC",
		"Text":"With an expert kick, Magnus managed to break the door off its hinges and send it flying into the room. The goblins inside were caught unawares, allowing the party the perfect opportunity to strike."
	},	{"Combat":"PCs"},
	{
		"Label":"ATH MIX",
		"Text":"With an expert kick, Magnus managed to break the door off its hinges and send it flying into the room. The goblins inside were caught unawares. Unfortunately, the speed of this maneuver caught his own party by surprise as well, giving the goblins enough time to steel themselves for the battle."
	},	{"Combat":"PCs"},
	{
		"Label":"ATH FAIL",
		"Text":"With an expert kick, Magnus managed to break the door off its hinges and send it flying into the room. He chased after the door and brandished his axe. Unfortunately, moving at the speed he was, he failed to notice the goblins hiding in alcoves along the walls. The goblins were only brought to his attention when they struck first."
	},	{"Combat":"Monsters"},
	
	
	
	{
		"Label":"STEALTH",
		"Text":"The thief led the party. He cautiously opened the door and crept inside."
	}, {
		"Check":{
			"Skill":"Stealth",
			"Character":"Party",
			"Success":"STEALTH SUCC",
			"Mixed":"STEALTH MIX",
			"Failure":"STEALTH FAIL"
		}
	},
	{
		"Label":"STEALTH SUCC",
		"Text":"They blended with the shadows and snuck into the room."
	},
	{
		"Label":"STEALTH CONV",
		"Text":"They had a chance then to sneak past a tough fight, avoiding it entirely. Though the party's mage noticed a shiny pile of coins by one of the sentries. The party...",
		"Choices":[
			{"Text":"Snuck away. The losses weren't worth the potential gain.", "Next":"SNEAK OUT"},
			{"Text":"Attacked, of course. They had the advantage and the goblins had gold.", "Next":"SNEAK ATTACK"},
			{"Text":"While the others decided what to do next, Morgan wanted that gold. [Stealth check]", "Next":"SNEAK MAGE"}
		]
	},
	{
		"Label":"STEALTH MIX",
		"Text":"They blended with the shadows and snuck into the room. Unfortunately, goblins could see decently well in the dark, so to distract one, the thief had to toss something to create a noise somewhere he and the party weren't. Unfortunately, the only thing he could part with and short of any loose rocks around, he had to part with a shiny gold coin.",
		"Resource":-1,
		"Next":"STEALTH CONV"
	},
	{
		"Label":"STEALTH FAIL",
		"Text":"They blended in with the shadows, and snuck into the room. Unfortunately, goblins could see well in the dark. They were expecting these tactics from adventurers like the party. They struck first."
	},	{"Combat":"Monsters"},
	
	{
		"Label":"SNEAK OUT",
		"Text":"The party avoided detection all the way to the door, quietly then opening it and slipping onto the other side.",
		"Next":"OUT"
	}, 
	{
		"Label":"SNEAK ATTACK",
		"Text":"Undetected, the party took position, waited for the perfect moment... and struck."
	}, {"Combat":"PCs"},
	{
		"Label":"SNEAK MAGE",
		"Text":"She whispered some arcane incantation, summoning a spectral hand near the pile of gold."
	},	{"Check":{
			"Skill":"Stealth",
			"Character":"Mage",
			"Success":"MAGESTEALTH SUCC",
			"Mixed":"MAGESTEALTH MIX",
			"Failure":"MAGESTEALTH FAIL"
		}
	},
	
	{
		"Label":"MAGESTEALTH SUCC",
		"Text":"She was completely undetected and managed to score some coin before returning to the party.",
		"Resource":1,
		"Next":"STEALTH CONV"
	},
	{
		"Label":"MAGESTEALTH MIX",
		"Text":"What she lacked in stealth, she made up for in speed. She managed to steal the gold and at least ready herself for the combat that would follow in the wake of her and the party's detection.",
		"Resource":1,
	},	{"Combat":"PCs"},
	{
		"Label":"MAGESTEALTH FAIL",
		"Text":"The goblins had keen eyes and--unfortunately for the mage--even keener ears. As soon as she muttered the incantation, the goblins noticed her and the party, attacking without a moment's hesitation.",
	},	{"Combat":"Monsters"},
	
	
	{
		"Label":"PERCEPTION",
		"Text":"Duri pressed his ear against the door. Time passed.
		\"We don't have all day, you know,\" Magnus reminded, \"So if you could-\"
		\"Shh...\" Duri interrupted."
	},	{"Check":{
			"Skill":"Perception",
			"Character":"Thief",
			"Success":"PER SUCC",
			"Mixed":"PER MIX",
			"Failure":"PER FAIL",
		}
	},
	
	{
		"Label":"PER SUCC",
		"Text":"They continued, \"I can hear something on the other side... goblins.\"",
		"Choices":[
			{"Text":"They were on alert.", "Next":"ALERT"},
			{"Text":"They were shirking their duties. [-1 stress]", "Next":"GAMBLING"}
		]
	},
	{
		"Label":"PER MIX",
		"Text":"\"Goblins.\""
	},{
		"Label":"ALERT",
		"Text":"\"They're on alert, sounds like. We could still try to sneak around them, but it'd be tough.\"
		\"Or we could just kill them and be done with it,\" said Magnus.
		Morgan said, \"I agree with the thief, we should sneak around them if we can. I'd rather not have to start burning through mana this early in the dungeon.\"
		Magnus pouted, \"Hmph.\"",
		"Next":"DOOR"
	},
	{
		"Label":"PER FAIL",
		"Text":"\"Nevermind. Can't hear anything, the wood's too thick.\"
		Magnus said, \"We oughta just open this door already. If there's anything on the other side, we can just kill it and move on.\"
		\"The thief is right to exercise caution, Warrior,\" said Morgan. \"No point in putting ourselves in harm's way unnecessarily.\"
		\"No point in standing around here letting our torches burn out,\" Magnus grumbled. \"Torches are expensive these days, you know.\"
		Duri rolled his eyes, \"Yes, you keep reminding us.\"",
		"Next":"DOOR"
	},
	
	{
		"Label":"GAMBLING",
		"Text":"\"Sounds like they're playing dice,\" Duri said. \"We could sneak around them.\"
		Morgan nodded in agreement, \"A good idea.\"
		\"Well whatever we do, we better do it quick,\" Magnus grumbled. \"Don't like just standing around waiting for our torches to burn out. Torches are expensive these days, you know.\"
		Duri rolled his eyes, \"Yes, you keep reminding us.\"",
		"Resource":-1,
		"Next":"DOOR AUTO STEALTH"
	},
	
	
	
	{
		"Label":"OUT",
		"Text":"They closed the door behind them and continued on down the darkened tunnel ahead."
	},
	{
		"Label":"END"
	}
]
